Autodesk.Revit.DB.CategorySet
/// A set that can contains Category objects.
///

Autodesk.Revit.DB.CategorySet.Insert(Autodesk.Revit.DB.Category)
System.Int32
Insert the specified category into the set.
item: The item to be inserted into the set.
Returns: Returns whether the item was inserted into the set.

Autodesk.Revit.DB.CategorySet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CategorySet.ReverseIterator
Autodesk.Revit.DB.CategorySetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.CategorySet.ForwardIterator
Autodesk.Revit.DB.CategorySetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CategorySet.Erase(Autodesk.Revit.DB.Category)
System.Int32
Removes a specified category from the set.
item: The category to be erased.
Returns: The number of items that were erased from the set.

Autodesk.Revit.DB.CategorySet.Contains(Autodesk.Revit.DB.Category)
System.Boolean
Tests for the existence of a category within the set.
item: The category to be searched for.
Returns: The Contains method returns True if the category is within the set, otherwise False.

Autodesk.Revit.DB.CategorySet.Clear
void
Removes every item from the set, rendering it empty.

Autodesk.Revit.DB.CategorySet.Size
System.Int32
get
Returns the number of categories that are in the set.

Autodesk.Revit.DB.CategorySet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.